app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "creator", "end_date", "name", "start_date", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2015-04-29 16:26:56.154762"], ["creator", "Bob"], ["end_date", "2016-04-29"], ["name", "Bob"], ["start_date", "2015-02-20"], ["updated_at", "2015-04-29 16:26:56.154762"]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save